Autodesk.Revit.DB.CompoundStructure.SetLayers(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CompoundStructureLayer})
Completely resets this CompoundStructure and applies a new set of layers.
Remarks:
This function will replace all existing layers with the contents of the input.  This provides a full
reset for the CompoundStructure. Therefore:
All layers will be marked as Core layers, and any settings related to Shell layers (such as Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex,
Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex or Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)) will be modified accordingly.Because all layers will be set as Core layers, the value of LayerCapFlag will be ignored (and set to true) automatically.The Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex will be unset.The Autodesk.Revit.DB.CompoundStructure.StructuralMaterialIndex will be unset.The compound structure will be set to be vertically homogeneous.
layers:
The layers to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL